package com.monster.monstersport.util;

/**
 * Created by ZhaoZongyao on 2018/1/30.
 */

public interface Constant {

    String TEST1 = "　　江湖中有耳朵的人，绝无一人没有听见过\"玉郎\"江枫和燕南天这两人的名字；江湖中有眼睛的人，也绝无一人不想瞧瞧江枫的绝世风采和燕南天的绝代神功。\n" +
            "\n" +
            "　　只因为任何人都知道，世上绝没有一个少女能抵挡江枫的微微一笑，也绝没有一个英雄能抵挡燕南天的轻轻一剑！任何人都相信，燕南天的剑非但能在百万军中取主帅之首级，也能将一根头发分成两根，而江枫的笑，却可令少女的心碎。\n" +
            "\n" +
            "　　但此刻，这出生帝富世家的天下第一美男子，却穿着件粗俗的衣衫，赶着辆破旧的马车，匆匆行驶在一条久已荒废的旧道上。\n" +
            "\n" +
            "　　此刻若有人见到他，谁也不会相信他便是那倚马斜桥、一掷千金的风流公子。\n" +
            "\n" +
            "　　七月，夕阳如火，烈日的余威仍在。\n" +
            "\n" +
            "　　人和马，都闷得透不过气来，但江枫手里的鞭子，仍不停鞭打着马。\n" +
            "\n" +
            "　　马车飞驶，将道路的荒草，都辗得倒下去，就好像那些曾经为江枫着迷的少女腰肢。\n" +
            "\n" +
            "　　突然，一声鸡啼，撕裂了天地的沉闷。\n" +
            "\n" +
            "　　但黄昏时，旧道上哪里来的鸡啼？江枫面色变了，明锐的目光，自压在眉际上的破帽边没望过去，只见一只大公鸡站在道旁残柳的树干上，就像钉在上面似的动也不动，那雄丽的鸡冠，多彩的羽毛，在夕阳下闪动着令人眩目的金光。\n" +
            "\n" +
            "　　公鸡的眼睛里竟也似有种恶毒的、妖异的光芒。\n" +
            "\n" +
            "　　江枫的面色变得更苍白，突然勒住了车马。\n" +
            "\n" +
            "　　健马长嘶，车缓缓停下，车厢中有个甜美温柔的语声问道：\"什么事？\"江枫微一一迟疑，苦笑道：\"没有什么，只不过走错路了\"拨转马头，兜了半个圈子，竟又向来路奔回，只听那公鸡又是一声长嘶却像是在对他冷笑。\n" +
            "\n" +
            "　　江枫打马更急，路上的荒草已被辗平，车马自是走得更快了，但还未奔出四十丈，道上竟又有样东西挡住了去路。这久已荒废、久无人迹的旧道上，此刻竟突然有只巨大的肥猪横卧在路中，又有谁能猜透这只猪是哪里来的？马车方才还驶过这条路，这条路上，方才明明连半斤猪肉都没有，而此刻却有了整整一只猪。\n" +
            "\n" +
            "　　江枫再次变色，再次勒住马车。\n" +
            "\n";

    String TEST2 = "　　健马长嘶，车缓缓停下，车厢中有个甜美温柔的语声问道：\"什么事？\"江枫微一一迟疑，苦笑道：\"没有什么，只不过走错路了\"拨转马头，兜了半个圈子，竟又向来路奔回，只听那公鸡又是一声长嘶却像是在对他冷笑。\n" +
            "\n" +
            "　　江枫打马更急，路上的荒草已被辗平，车马自是走得更快了，但还未奔出四十丈，道上竟又有样东西挡住了去路。这久已荒废、久无人迹的旧道上，此刻竟突然有只巨大的肥猪横卧在路中，又有谁能猜透这只猪是哪里来的？马车方才还驶过这条路，这条路上，方才明明连半斤猪肉都没有，而此刻却有了整整一只猪。\n" +
            "\n" +
            "　　江枫再次变色，再次勒住马车。\n" +
            "\n" +
            "　　只见那只猪在地上翻滚着，但全身上下，却被洗得干干净净，那紧密的猪毛，在夕阳下就像是金丝织成的毯子一样。\n" +
            "\n" +
            "　　门窗紧闭的车厢里，又传出人语道：\"什么事？\"江枫语塞：\"我……我……\"那甜美温柔的人语轻叹着道：\"你又何苦瞒我？我早已知道\"江枫失声道：\"你早已知道了？\"我方才听见那声鸡啼，便已猜出必定是十二星相中人找上咱们了，你怕我担心,所以才瞒着我，是么？\"江枫长叹一声，道：\"奇怪……你我此行如此秘密，他们怎会知道？但……但你只管放心，什么事都有我来抵挡\"车厢中人柔声道：\"你又错了，自从那天……那天我准备和你共生共死，无论有什么危险艰难，也该由咱们俩共同承当。\"\"但你现在……\"\"没关系，现在我觉得很好。\"江枫咬了咬牙，道：\"好，你还能下车走么？道路两头都已有警象，看来咱们也只有弃下车马，穿过这一片荒野……\"\"为什么要弃下车马呢？他们既已盯上咱们，反正已难脱身\"。倒不如就在这里等着，十二星相虽有凶名，但咱们也未必怕他们！\"\"我……我只是怕你……\"\"你放心，我没关系。\"江枫面上忽又现出温柔的笑容，轻轻道：\"我能找着你，真是最幸运的事。\"他在夕阳下笑着，连夕阳都似失却了颜色。\n" +
            "\n" +
            "　　车厢人娇笑道：\"幸运的该是我才对，我知道，江湖中不知道有多少女孩子在羡慕我，妒忌我，只是她们……\"语声未了，健马突然仰道惊嘶起来──暮风中方自透出新凉，这匹马却似突然出了什么惊人的警兆！一阵风吹过，猪，在地上翻了个身，远处隐隐传来鸡啼，荒草在风中摇舞，夕阳，黔淡了下来，大地竟似突然被一种不祥的气氛所笼罩，这七月夕阳下的郊野，竟突然显得说不出的凄凉、萧瑟！江枫变色道：\"他们似已来了！\"突然马车后有人喋喋笑道：\"不错，咱们已来了！\"这笑声竟也如鸡啼一般，尖锐、刺耳、短促，江枫一生之中，当真从未听过如此难听的笑声。\n" +
            "\n" +
            "　　他大惊转身，轻叱道：\"谁？！\"\n" +
            "\n" +
            "　　鸡啼般的笑声不绝，马车后已转出七八个人来。\n" +
            "\n" +
            "　　第一个人，身长不足五尺，瘦小枯干，却穿着一身火红的衣裳，那模样正有说不出的诡秘，说不出的猥琐。\n" +
            "\n" +
            "　　第二个人，身长却赫然在九尺开外，高大魁伟，黄衣黄冠，那满脸全无表情的横肉，看来比铁还硬。\n" +
            "\n" +
            "　　后面踉着四个人打扮得更是奇怪，衣服是一块块五颜六色的绸锻缝成的，竟像是戏台上乞丐穿着的富贫衣。\n" +
            "\n" +
            "　　这四人身材相貌不相同，却都是满面凶光、行动骠悍的汉子，举手投足，也是一模一样，谁也不快上一分，谁也不慢上一分。\n" +
            "\n" +
            "　　还有个人远远跟在后面，前面七个人加起来，也末见会比这人重上儿斤，整整一匹料子，也未见能为此人做件衣服，他胖得实在已快走不动了，每走一步，就喘口气，口中不住喃喃道：\"好热，热死人了。\"满头汗珠，随着他颤动的肥肉不住地流下来。\n" +
            "\n" +
            "　　江枫跃下马车，强作镇定，抱拳道：\"来的可是十二星相中之司晨客与黑面君么？\"红衣人格格笑道：\"江公子果然好眼力，但咱们不过是一只鸡、一只猪而已，司晨客、黑面君，这些好听的名字，不过是江湖中人胡乱取的，咱们担当不起。\"江枫目光闪动道：\"阁下想必就是～\"红衣人截口笑道：\"红的是鸡冠，黄的是鸡胸，花的是鸡尾，至于后面那位，你瞧他的模样像什么，他就是什么。\n" +
            "\n" +
            "　　江枫道：\"几位不知有何见教？\"\n" +
            "\n" +
            "　　红衣鸡冠道：\"闻得江公子有了新宠，咱兄弟都忍不住想来瞧瞧这位能令玉郎心动的美人儿究竟美到什么地步，再者，咱兄弟还想来向公子讨件东西\"江枫暗中变色，口中却仍然沉声道：\"只可惜在下此次匆匆出门，身无长物，哪有什么好东西，能入得了诸位名家法眼\".鸡冠人喋喋笑道：\"江公子此刻突然将家财完全变卖，咱们虽不知为的是什么，也不想知道，但江公子以田庄换来的那袋明珠……嘿嘿，江公子也该知道咱们十二星相向来贼不空手,公子就把那袋明珠赏给咱们。\"江枫突也大笑道：\"好，好，原来你们倒竟也打听得如此清楚，在下也知道十二星相从来不轻易出手，出手后从不空回，但……\"鸡冠人道：\"但什么，你不答应？\"江枫冷笑道：\"若要我答应，只有……\"语声未了，闪闪银光，已到了他胸口。\n" +
            "\n" +
            "　　这鸡冠人好快的手法，眨眼间，手中已多了件银光闪闪的奇形兵刃，似花锄，如钢啄，闪电般击向江枫，眨眼间已攻出七招，那诡异的招式，看来正如公鸡啄米一般，沿着江枫手足少阴经俞府、神法、灵墟、步廊……等要穴，一路啄了下去。\n" +
            "\n" +
            "　　江枫平地跃起，凌空一个翻身，堪堪避过了七啄，但这时却又有四对鸡爪镰在地上等着。\n" +
            "\n";

    String TEST3 = "　　鸡枫一动，鸡尾立应，那四个花衣鸡尾人的出手之快，正也不在红衣鸡冠之下，四对鸡爪镰刀，正也是江湖罕暑的外门功夫，一个啄，四个抓，招式配合得滴水不漏，就算是一个人生着九只手，呼应得也未必如此微妙。\n" +
            "\n" +
            "　　江枫自然不是等闲人物，但应付这五件外门兵刃，应付这从来未见的奇诡招式，已是左支右拙，大感吃力、何况还有个满脸横肉、目光闪动的黄衣鸡胸正在一旁目不转睛地瞪着他，只等着他破绽露出。\n" +
            "\n" +
            "　　黑面君嘻嘻笑道：\"哥儿们，加油，咱们可不是女人，可莫要对这小子生出怜香惜玉的心，兄弟我且先去睢瞧车子里的小美人儿。\"江枫怒喝道：\"站住！\"他虽想冲过去，怎奈那九件兵刃却围得他风雨不透，而这时黑面君已蹒跚地走向车厢，伸手去拉门。\n" +
            "\n" +
            "　　就在这时，车窗突然开了一线，里面伸出一只白生生的玉手，那纤柔、毫无瑶疵的手指中，却夹者只梅花。\n" +
            "\n" +
            "　　黑色的梅花！盛夏中有梅花，已是奇事，何况是黑色的梅花？！白的手，黑的梅花，衬托出一种无法形容的、神秘的美，车厢中甜美的语声一字字缓缓道：\"你们瞧瞧这是什么？\"黑面君的脸，突然扭曲起来，那只正在拉门的手，也突然不会动了，鸡嘴啄、鸡爪镰，更都在半空顿住！这六个凶名震动江溺的巨盗，竟似都突然中了魔法，每个人的手、脚、面目，都似已突然被冻结。\n" +
            "\n" +
            "　　黑面君嘎声道：\"绣玉谷，移花宫…\"车厢中人道：\"你的眼力倒也不错。\"黑面君道：\"我……小人。\"\n" +
            "\n" +
            "　　牙齿打战，竟是一句话也说不出来。\n" +
            "\n" +
            "　　车厢人柔声道：\"你们想不想死？\"\n" +
            "\n" +
            "　　\"小人，不……\"\"。\n" +
            "\n" +
            "　　\"不想死的还不走！\"\n" +
            "\n" +
            "　　这句话还末说完，红的、黄的、花的、黑的，全部飞也似的走了──黑面君脚步也不再蹒跚，口中也不喘气了，若非亲眼瞧见，谁也不会相信这么胖的人会有如此轻灵的身法。\n" +
            "\n" +
            "　　江枫一步窜到车窗前，道：\"你……你没事么了\"车厢人笑道，\"我只不过招招手而已。\"江枫松了口气，叹道：\"不想你竟从宫中带出了朵墨玉梅花连十二星相这样的凶人，竟也对她们如此惧怕。\"车厢中人道：\"由此你就可想到她们有多可怕，咱们还是快走吧，别的人来了都不要紧，但若是……\"突然间，只听\"嗖嗖嗖\"衣袂破风之声骤响，方才逃了的人，此刻竟又全部回来了，来的竟比去时还快。\n" +
            "\n" +
            "　　黑面君格格笑道：\"咱们险些上当了，车子里若真是移花宫中的人，方才还能活着走么？你几时听说过移花宫手下留得有活口？\"车厢中人道：\"我饶了你，你竟还……黑面君大喝道：\"冒牌货，出来吧！\"突然出手一举，那车门竟被一拳击碎！车厢里坐着的乃是个云鬓蓬乱、面带病容的妇人，却仍掩不住她的天香国色──他眼睛并不十分媚秀，鼻子并不十分挺刺。嘴唇也不十分娇小，但这些凑在一起，却教人瞧了第一眼后，目光便再也舍不得离开，尤其是她那双眼睛里所包涵的情感、了解与智慧，更是深如海水。\n" +
            "\n" +
            "　　只是她的腹部却高高横起，原来竟已身怀六甲。\n" +
            "\n" +
            "　　黑面君怔了一怔，突然大笑道：\"原来是个大肚婆娘，居然还敢冒充移花官的……\"话末说完，那少妇身子突然飞了出来，黑面君还未弄清是怎么回事，脸上已\"□□啪啪\"被她掴了几个耳光。\n" +
            "\n" +
            "　　那少妇身子又已掠回，轻笑道：\"这大肚婆如何？\"黑面君怒吼一声，道：\"暗算偷袭，又算得了什么？\"一拳击了出去，这身子虽臃肿，但这一拳击出，却是又狠、又快、又辣！那少妇面上仍带着微笑，纤手轻轻一引、一拨，也不知她用了什么手法，黑面君这一拳竟被她拨了，\"砰\"的一拳，竟打在自己肩头上，竞偏偏不能收住，也不能闪避，他一拳击碎车门，是何等气力，这一拳竞自己将自己打得痛吼着跃倒在地上。\n" +
            "\n" +
            "　　鸡冠鸡尾本也跃跃欲试，但此刻却又不禁怔住了，目瞪口呆地瞧着这少妇，连手指都不敢动一动。\n" +
            "\n" +
            "　　黑面君颤声道：\"移花接玉，神鬼莫敌……\"那少妇道：\"你既然知道，便也该知道我是不是冒充的。\"黑面君道：\"小……小人该死，该死！……\"抡起手来，正反掴了自己十几个耳括子，打得他那张脸更黑胖了。\n" +
            "\n" +
            "　　那少妇叹了口气，道：\"我要为孩子积点阴德，你们……你们快走吧。\"这一次他们自然逃得更快，眨眼间便逃得踪影不见，但暮色苍茫中，远处却有条鬼魅般的人影一闪，向他们追了过去。\n" +
            "\n" +
            "　　江柯瞧见他们去远，才又松了口气，叹道，\"幸亏你还有这一手，又将他们骇佳，否则……\"突然发现那少妇面上已变了颜色，身子颤抖着，满头冷汗。滚滚而落，竟似已疼得不能忍受。\n" +
            "\n" +
            "　　江枫大惊道：\"你怎么了\"那少妇道：\"我……发动了胎气……只怕……只怕已……快要……\"她话还没说完，江柯已慌得乱了手脚，跺足道\"这如何是好？\"那少妇嘶声道：\"你快将车子赶到路旁……快……快……快！\"江枫手忙脚乱地将车子赶到路旁长草里，健马不住长嘶着，江枫不停地抹汗，终于一头钻进车厢里,破了的车门，被长衫挡了起来。大约数盏茶的时间，车厢中突然传出婴儿嘹亮的哭声。";
}
