package com.monster.monstersport.util;

/**
 * Created by ZhaoZongyao on 2018/1/30.
 */

public interface Constant {
    String TEST_CONTENT =
                    "　　冷先生的中药和针灸对鹿子霖全部无能为力，他被家人捆在树上灌进一碗又一碗汤药，仍然在裤裆里尿尿屙屎。他的有灵性的生命已经宣告结束，没有一丝灵性的生命继续延缓下来。女人鹿贺氏也不再给他换衣换裤裤，只在吃饭时塞给他一碗饭或一个馍，就把他推出后门，他身上的新屎陈尿足以使一切人窒息。夜晚他和那条黄狗蜷卧在一起，常常从狗食盆里抓起剩饭塞进嘴里。\n" +
                    "\n" +
                    "　　白嘉轩看着鹿子霖挖出一大片湿土，被割断的羊奶奶蔓子扔了一堆，忽然想起以卖地形式作掩饰巧取鹿子霖慢坡地做坟园的事来，儿子孝文是县长，也许正是这块风水宝地荫育的结果。他俯下身去，双手拄着拐杖，盯着鹿子霖的眼睛说：“子霖，我对不住你。我一辈子就做下这一件见不人的事，我来生再世给你还债补心。”鹿子霖却把一颗鲜灵灵的羊奶奶递到他眼前：“给你吃，你吃吧，咱俩好！”白嘉轩轻轻摇摇头，转过身时忍不住流下泪来。\n" +
                    "\n" +
                    "　　农历四月以后，气温骤升，鹿子霖常常脱得一丝不挂满村乱跑。鹿贺氏把他锁在柴禾房里，整整锁了半年之久。他每到晚上，便嚎着叫着哭着唱着，村里人已经习以为常。入冬后第一次寒潮侵袭白鹿原的那天夜时，前半夜还听见鹿子霖的嚎叫声，后半夜却屏声静气了。天明时，他的女人鹿贺氏才发现他已经僵硬，刚穿上身的棉裤里屎尿结成黄蜡蜡的冰块……";

}
