package me.sugarkawhi.mreader.config;


/**
 * 配置类
 * Created by ZhaoZongyao on 2018/1/11.
 */

public interface Config {

    boolean DEBUG = true;

    int DEFAULT_BATTERY_WIDTH = 60;
    int DEFAULT_BATTERY_HEIGHT = 20;
    int DEFAULT_BATTERY_HEAD = 10;
    int DEFAULT_BATTERY_GAP = 3;
    int DEFAULT_CONTENT_TEXTSIZE = 50;
    int DEFAULT_CHAPTER_TEXTSIZE = 30;
    int DEFAULT_CONTENT_LINE_SPACING = 20;
    int DEFAULT_CONTENT_PARAGRAPH_SPACING = 40;
    String TEST_CONTENT =
            "　　赵家屯，位于凤凰山下，依山傍水，景色宜人。但因为交通不便，这个屯子很穷。穷到连吃肉都成为了很奢侈的事情，穷到连电灯都不舍得用。\n" +
                    "　　当然，赵家屯这个名字已经成为过去式了，十里八乡赫赫有名的女人村。\n" +
                    "　　当然，赵家屯这个名字已经成为过去式了，如今成为了十里八乡赫赫有名的女人村。\n" +
                    "　　这件事说起来还要追溯到一年以前，村里首富赵大山在城里工地上接了一个安装水电暖的工程。这个工程很大，如果按时完工能赚个几十万。\n" +
                    "　　本打算让全村老爷们跟着多赚几个，谁知道那个小区是豆腐渣工程，就在全村老爷们如火如荼的安装着水电暖的时候，那座小区直接坍塌了。\n" +
                    "　　而赵家屯所有人都被掩埋到了废墟下，当被人们拔出来后，二百多人都已经不幸遇难了。\n" +
                    "　　虽然和赵大山没有直接关系，但这件事却是因他而起。而他瞬间成为赵家屯中万夫所指的罪人。\n" +
                    "　　因为良心有愧，赵大山服下敌敌畏自尽了。\n" +
                    "　　赵大山虽然解脱了，但是却留下年仅十六岁的赵小宁独自一人生活在赵家屯，生活在人们的指指点点中。\n" +
                    "　　赵大山虽然解脱了，但是却留下年仅十六岁的赵小宁独自一人生活在赵家屯，生活在人们的指指点点中。\n" +
                    "　　赵大山虽然解脱了，但是却留下年仅十六岁的赵小宁独自一人生活在赵家屯，生活在人们的指指点点中。\n" +
                    "　　一座长满杂草的坟圈子前，赵小宁眼睛痛苦的坐在那里，虽然才十六岁，但五官清秀。尤其是那满是沧桑的双眸更是同龄人所无法拥有的。洗的发黄的白色体恤，搭配一条大裤衩，千层底，地地道道的农家小子的装扮。\n" +
                    "　　当然，赵家屯这个名字已经成为过去式了，如今成为了十里八乡赫赫有名的女人村。\n" +
                    "　　一座长满杂草的坟圈子前，赵小宁眼睛痛苦的坐在那里，虽然才十六岁，但五官清秀。尤其是那满是沧桑的双眸更是同龄人所无法拥有的。洗的发黄的白色体恤，搭配一条大裤衩，千层底，地地道道的农家小子的装扮。\n" +
                    "　　当然，赵家屯这个名字已经成为过去式了，如今成为了十里八乡赫赫有名的女人村。\n" +
                    "　　一座长满杂草的坟圈子前，赵小宁眼睛痛苦的坐在那里，虽然才十六岁，但五官清秀。尤其是那满是沧桑的双眸更是同龄人所无法拥有的。洗的发黄的白色体恤，搭配一条大裤衩，千层底，地地道道的农家小子的装扮。\n" +
                    "　　当然，赵家屯这个名字已经成为过去式了，如今成为了十里八乡赫赫有名的女人村。\n" +
                    "　　一座长满杂草的坟圈子前，赵小宁眼睛痛苦的坐在那里，虽然才十六岁，但五官清秀。尤其是那满是沧桑的双眸更是同龄人所无法拥有的。洗的发黄的白色体恤，搭配一条大裤衩，千层底，地地道道的农家小子的装扮。\n" +
                    "　　一座长满杂草的坟圈子前，赵小宁眼睛痛苦的坐在那里，虽然才十六岁，但五官清秀。尤其是那满是沧桑的双眸更是同龄人所无法拥有的。洗的发黄的白色体恤，搭配一条大裤衩，千层底，地地道道的农家小子的装扮。\n" +
                    "　　一座长满杂草的坟圈子前，赵小宁眼睛痛苦的坐在那里，虽然才十六岁，但五官清秀。尤其是那满是沧桑的双眸更是同龄人所无法拥有的。洗的发黄的白色体恤，搭配一条大裤衩，千层底，地地道道的农家小子的装扮。\n";

}
