package com.monster.monstersport.activity;

import android.os.Bundle;
import android.support.annotation.Nullable;
import android.support.v7.app.AppCompatActivity;
import android.view.View;
import android.view.WindowManager;
import android.widget.Toast;

import com.monster.monstersport.R;

import me.sugarkawhi.mreader.bean.ChapterBean;
import me.sugarkawhi.mreader.listener.IReaderTouchListener;
import me.sugarkawhi.mreader.view.MReaderView;

/**
 * Created by ZhaoZongyao on 2018/1/12.
 */

public class ReaderActivity extends AppCompatActivity {

    MReaderView readView;

    @Override
    protected void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        getWindow().addFlags(WindowManager.LayoutParams.FLAG_TRANSLUCENT_STATUS);
        setContentView(R.layout.activity_reader);
        readView = findViewById(R.id.readerView);
        ChapterBean chapter = new ChapterBean();
        chapter.setBookName("《白鹿原》");
        chapter.setChapterName("第13章 一波未平 一波又起");
        chapter.setChapterContent(TEST_CONTENT);
        readView.setChapter(chapter);
        readView.setElectric(0.6f);
        readView.setTime("BJ TIME：19:20");
        readView.setReaderTouchListener(new IReaderTouchListener() {
            @Override
            public boolean canTouch() {
                return true;
            }

            @Override
            public void onTouchCenter() {
                Toast.makeText(ReaderActivity.this, "onTouchCenter", Toast.LENGTH_SHORT).show();
            }

            @Override
            public boolean onTouchRight() {
                return false;
            }

            @Override
            public boolean onTouchLeft() {
                return false;
            }
        });
        hideSystemUI();
    }


    @Override
    protected void onResume() {
        super.onResume();
        hideSystemUI();
    }

    /**
     * 隐藏菜单。沉浸式阅读
     */
    private void hideSystemUI() {
        getWindow().getDecorView().setSystemUiVisibility(
                View.SYSTEM_UI_FLAG_LAYOUT_STABLE
                        | View.SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN
                        | View.SYSTEM_UI_FLAG_FULLSCREEN // hide status bar
                        | View.SYSTEM_UI_FLAG_IMMERSIVE_STICKY
        );
    }

    private void showSystemUI() {
        getWindow().getDecorView().setSystemUiVisibility(View.SYSTEM_UI_FLAG_LAYOUT_STABLE
                | View.SYSTEM_UI_FLAG_LAYOUT_FULLSCREEN
                | View.SYSTEM_UI_FLAG_IMMERSIVE_STICKY
        );
    }

    String TEST_CONTENT = "农历四月，急骤升高的气温宣告结束了白鹿原本来就短暂的春天，进入初夏季节。满原的麦子从墨绿中泛出一抹蛋白色，一方一绺已经黄熟的大麦和青稞夹缀在大片麦田中间，大地呈现出类似孕妇临产前的神圣和安谧。从气象和节令上判断，似乎与已往无数个春夏之交时节的景致没有什么大的差异，无论穷的或富的庄稼人，只是习惯性地比较着今年的节令比去年提早了几天或者推迟了小半月，穷庄稼人总是比富裕庄稼人更多一些念叨和嘟囔罢了，也是因为他们更加迫不及待地要收获小麦，以减少借贷的次数和数量。迎接果实成熟的期待，比以往任何时候都更加迫切。眼巴巴瞅着麦子一天天由绿变黄，急性子的庄稼人提着镰刀拉着独轮小车走到田头，捉住麦穗捏一捏瞅一瞅，麦粒还是鼓胀的水豆儿，惋叹一声“外黄里不黄喀”！于是就提上镰刀拉上小推车回家去了。突然一场温腾腾热燥燥的南风持续了一夜半天，麦子竟然干得断穗掉粒了，于是千家万户的男人女人大声叹着“麦黄一晌蚕老一时”的古训拥向田野，唰唰嚓嚓镰刀刈断麦秆的声浪就喧哗起来。就在那神秘的短促的一响里，麦子熟透了；就在那神秘的一时里，蚕儿上族网茧了……\n" +
            "\n" +
            "    公元一九四九年五月二十日，成为白鹿原社会气候里神秘短促的一晌或一时，永久性地改变了本原的历史。\n" +
            "\n" +
            "    黑娃听到电话铃响，心里一跳；每一次电话铃声响，都好像首先撞击的不是耳膜而是心脏。黑娃抓起话机扣到耳朵上，方知是县西四十里处的麻坊镇哨卡打来的。哨兵的嗓门有点粘涩：“一位少校军官要过哨卡，要到县里找你。鹿营长，你说放不放他过卡子？他不说他的姓名，也不报他的来处，却是叫我问你鹿营长还喜欢不喜欢吃冰糖……”\n" +
            "\n" +
            "    黑娃搞不清有多长时间自己都处于一种无知觉状态，灵醒过来后，发现话机还扣在左耳朵上，汗水顺着话机的下端滴滴到手心里。他已经忘记刚才是怎么回答哨兵的，耳机里早已变成一片冷寂的盲音。他判断不出自己现在比接电话以前更加慌乱，还是更加沉静，却努力回想刚才在电话里自己是怎样问答哨兵间询的，或者根本就没有作任何回答？他颤抖着手摇起搅把儿，直摇得黑色的电话机在桌子上发摆子似的颤抖，终于到那个不再粘涩的嗓门讨封似他说：“放心吧鹿营长，早已放过了。我给少校挡了一辆道奇卡车，坐上走了半晌了，说不定这阵儿都跷进你的门坎咧！”黑娃放下电话跨出门去，门外一片静寂。旋即又走进屋子，扯下毛巾直接塞进盆架下边的水桶里醮了水，使劲擦试汗腻腻的脸颊和脖颈，然后又脱了上衣和长裤，用马勺舀起凉水往身上泼浇。水流在砖地上，流不出多远就渗，进蓝色的砖头，发出干燥焦渴已极的吱吱声。这当儿，门外响，起卫士的问话声，一个熟悉的声音说：“你不甭盘问我，我来盘问你。你只知你们鹿营长官名叫鹿兆谦，你知不知道他的小名叫黑娃？你知不知道他敲家伙爱敲‘风搅雪’？黑娃穿着裤叉，急忙跷出门喊道：“我也记着你的小名，我不好意思再叫！”\n" +
            "\n" +
            "    通身水淋淋的鹿黑娃只穿着一条水淋淋的裤叉，和佩戴着少校肩章一身伪装的鹿兆鹏紧紧搂抱在一起，两个荷枪实弹的卫士看见两人的真挚和滑稽，却无法体味这两个朋友此刻里的心境。还是黑娃首先松开手臂，拽着兆鹏的胳膊走进门去。他从里头插死了门闩，想想不妥又拉开，只对卫士说了一句：“谁来也不许打扰！”然后又插上门闩，急忙蹬裤穿衣服，转过脸问：“我的你呀，你咋么着蹦到这儿来咧？”鹿兆鹏从桌子上的烟盒：里抽出香烟点火抽起来，说：“你甭问，你先给人弄俩蒸馍吃，我大概还是昨个晚上过渭河时吃的饭……”\n" +
            "\n" +
            "    鹿兆鹏身为十五师联络科长，是和首批强渡渭河的四十八团士兵一起涉过古都西安的最后一道天然水障的。出发前一刻，他肚子里填塞了整整一个小锅盔，这使他联想起锅盔这种秦人食品的古老的传说。这种形似帽盔的食品，正是适应古代秦军远征的需要产生的，后来才普及到普通老百姓的日常生活里。它产生于远古的战争，依然适应干今天的战争。渭北原地无以数计的村庄里数以千万计的柴禾锅灶里，巧妇和蠢妇一齐番心尽智在烙锅盔，村村寨寨的街巷里弥漫着浓郁的烙熟面食的香味。分到鹿兆鹏手里的锅盔已经切成细长条，完全是为了适应战士装炒面的细长布袋；而这种食品的传统刀法是切成大方块，可以想见老百姓的细心。那些细长的锅盔条上，有的用木梳扎下许多几何图案，有的点缀着泮红的俏饰，有的好像刻着字迹，不过都因切得太细太碎而难以辨识。鹿兆鹏掬着分发到手的锅盔细条时，深为惋借，完整的锅盔和美丽的图案被切碎了，脑子里浮现出母亲在案板上放下刚刚出锅的锅盔的甜蜜的情景。\n" +
            "\n" +
            "    鹿兆鹏是微明时分涉过渭河的，先遣支队在河里插下好多道芦苇秆儿，作为过河路线的标记，最深处的水淹到胸脯，枪枝和干粮托到头顶。渡河遇到并不强硬的阻击，掩护他们的火炮和机枪压得对岸的守军喘不过气来。跨上对岸的沙地，才发现守军单薄得根本不像守备的样子，士兵早趁着黑夜潜逃了，统共只抓到三个俘虏，又看不到太多的尸体，机枪和步枪扔得遍地，一个强大的王朝临到覆灭时竟然如此不堪一击。\n" +
            "\n" +
            "    鹿兆鹏和他的十数个联络科的战士和干部，极力鼓动渡河的营长长驱直入，而违背了到三桥集结的命令，一直闯进西门外的飞机场。守军的阻击不过像一道木桩腐朽的篱笆，很快被攻破。机场上停着几架飞机，全都是残破报废的老鹰似的僵尸。鹿兆鹏用短枪敲一敲铝壳说：“胡长官总是撂下伤兵。这时候，有战士引着一位穿商人服装的人走过来，说他是西安地下党派来的，接应解放大军来了。鹿兆鹏用枪管又敲了敲机壳，郑重地纠正说：“老王同志，你务必记住，从现在起，我们从地下走到地上，成为地上党罗！”\n" +
            "\n" +
            "    老王同志把西安市区地图和国民党守备部队布防情况资料交给他，又把敌人逃亡前夕破坏炸毁电厂面粉厂和屈指可数的几家新兴工厂的计划透露给他。鹿兆鹏和营长只说了一句，就统一了看法：立即进城！老王同志帮他们找来了一位鬓发霜白的火车司机，全营士兵爬上了火车。火车呼啸着开进火车站时，头一次乘坐火车的土八路们惊叫，一支纸卷的喇叭牌香烟才抽掉半截。这营士兵被分成若干小组赶赴电厂面粉厂和纱厂等要害工厂去了。据说奔到电厂的士兵冲进厂房时，敌特工人员正在垒堆美制炸药铁箱。鹿兆鹏走出火车站的时候，听到西城方向传来一声巨响，等他穿过小巷赶到钟楼时，恰好看见一队冲上钟楼的战士矫健的姿态，领头的战士擎着一面红旗，沿着这座城市中心的明代建筑的四方围栏奔跑着呼叫着，那一刻兆鹏直后悔没有一架照相机。他随之得知，刚才的那一声巨响是本师本团另一个营的士兵攻进西门时放的炮。西门的门洞被砖头堵死了，不得不动用炸药以满足情急的战士的心理。他终于亲自迎接了五月二十日这个早晨，亲眼目睹了一个旧政权的灭亡和一个新政权诞生的最初过程。面对钟楼上迎风招展的红旗，他流下一行热泪，这正是祭奠无数烈士的最珍贵的东西。\n" +
            "\n" +
            "    他回到飞机场时已是后响，把一大堆情报交给师首长，师长的奖励是“你吃口东西快来。”这时，他才记起渡河的时候身边一个不知姓名的战士被枪弹击中扑跌进水里，他扶他的时候弄湿了干粮袋，那些刻扎着图案和悄饰的锅盔全泡成一堆糊糊。他已经忘记饥饿，巨大的欢愉和紧绷的心弦使他的胃全部处于一种休眠状态。直到天黑，鹿兆鹏被师长亲自召来分配新的任务：“回你的老家去，策动滋水保安团起义。”\n" +
            "\n" +
            "    鹿兆鹏穿上了师长为他准备好的一身国民党军少校军服，只是为缺一双皮鞋而遗憾，随之有人从俘虏的机场守军脚上搜出一双皮鞋送来，稍微显小而夹脚。鹿兆鹏说：“恐怕得有一部汽车。”师长说：“我给你准备了一辆自行车，气儿已经打饱了。你现在就上路。”鹿兆鹏跨上车子就走了。\n" +
            "\n" +
            "    这是令人舒心的一个难得的夜游的机会。田野里静悄悄，夜风中饱含着成熟期的麦子散发出来的母乳一样令人贪婪的气息。兆鹏可以准确地辨别出麦子和豌豆地里散发的不同气息，借着整修链条的时机，他摸到豌豆地里捋了一把豆荚和蔓梢，连荚儿带叶一起塞到嘴里咀嚼起来。沿途所过的大小村庄几乎看不见一点灯光，只有零星的几声装模作样的狗吠，听起来反倒使人感到安全感到松驰。驱车进入滋水河川，瞅见星光下横亘着白鹿原刀切一样的平顶，心中便跃出了那个尚在识字以前就铸入了的白鹿。这辆破自行车总是掉链儿，迫使他一次又一次跳下来摸黑把链条挂到齿轮上，中断了他诸多的回忆和回忆的情绪。\n" +
            "\n" +
            "    赶到离县城还有四十里的麻坊镇，遇到唯一一次盘查。土石公路上横架着一根粗大的木头，两边是几个地方武装的团丁，有一间小房子。鹿兆鹏从一个哨兵盘问的口音里听出他是当地人，他把“三”的发音说成“桑”，把“伯”称呼叫作“贝”，这是麻坊镇周围十数个村子居民的一种奇特的发音。鹿兆鹏看着这个麻坊镇土著团丁过分认真的态度，反而更加轻视他，小娃娃你正在认真防务的那个政权已经在我手下覆灭，你瓜蛋儿你笨熊还被蒙在鼓里。他轻淡地说：“你给鹿兆谦营长挂电话，他是我表弟，他大我叫桑（三）贝（伯）。”哨兵眼睛一亮，就透出他的全部纯朴和可爱的本性：“哎呀长官，听口音你是咱麻坊镇方圆人？哪个村子的？”鹿兆鹏笑着拍了拍他的肩膀说：“先甭拉扯乡党，快挂电话，你只消问问鹿营长还喜不喜欢吃冰糖？”哨兵问完这句话后，脸色一变举手敬礼，慌急中把电话筒拽掉到地上……整个哨卡的哨兵都忙碌起来，一齐出动挡任一辆道奇卡车，把自行车架到车厢里，把兆鹏搀扶到驾驶楼里以后，那个土著团丁用枪点着司机说：“你要是路上捣乱怠慢了长官，你再回来路过时，我把你舌头拔了喂狗。”\n" +
            "\n" +
            "    鹿兆鹏吃了黑娃临时凑合的饭菜，很简单地介绍了西安解放的消息。黑娃似乎并不惊奇，只是淡淡他说：“你不来我还不知道哩！这儿离西安不到百里，居然没有给我们通报，许是自顾自个跑了。”鹿兆鹏坦率他说：“黑娃起义吧！”\n" +
            "\n" +
            "    黑娃几乎没有思索地就重复了一句“起义”。他口气显得平静，既没有热烈奔放的张力，也不是畏畏缩缩无可奈何。鹿兆鹏在感情上很不满足，煽动说：“你老早就喊在原上刮起一场‘风搅雪’，而今到了刮这场‘风搅雪’的日子了，我听你的口气怎么不斩劲？”黑娃仍然平静他说：“斩劲不斩劲甭看嘴头上的功夫。”接着就给鹿兆鹏介绍了保安团的布防情况。黑娃自己的三营是个炮营，驻扎在最远的县东方向的古关峪口，原是为堵截共军从峪口出山进击县城的。二营是步兵营，驻守在县城东边与古关峪日两交界的地方，是防备共军进攻县城的第二道防线。一营驻扎在县城城墙里外，是保护县府的御林军，也是最后一道防线。黑娃进一步深层地介绍了保安团里的关系：二营长焦振国和他也是结拜弟兄，人好，估计有七成的把握，即就他不愿意起义也不会烂事；一营御林军营长白孝文，和他虽说也有过结拜的交情，却是张团长的打心锤儿心腹，恐怕只有四成起义的可能性。鹿兆鹏迫不及待地问：“张团长那人的把握性有几成？”黑娃坦率他说：“团长那人难估。”\n" +
            "\n" +
            "    在策动保安团起义的具体办法上，俩人不谋而合，其实这是根据黑娃介绍的情况所能作出的自然的也很简单的选择。鹿兆鹏说：“咱俩先跟二营长接触，二营长愿意起义的话，剩下一营的孝文就好办了。他愿意了干搭，不愿意的话，就把他的御林军拾掇了。”黑娃对这个策划做了小小的补充：“孝文愿意起义的话，张团长就不再成为一个问题；孝文要是说不通，把他和张团长先拾掇了。掐了谷穗子，谷秆子还不好砍吗？”兆鹏已经吃饱喝足，忙问：“咱们去找二营长吧，事不宜迟。”黑娃稳稳地说；“和二营长交涉你不用去了，等到和孝文摊牌的时候，你得出马。我骑马去二营，你这会儿可以眯糊一会儿解解乏。”\n" +
            "\n" +
            "    完全是一路凯歌。今日的胜利与十几二十几年的艰难曲折悲壮凄凉一样合情合理。鹿兆鹏听从黑娃的关照躺上床，头一挨枕头就拉起了鼾声，几十年来经历的大大小小的冒险事件磨炼了他的性气，可以抓住一切短暂的时机进入睡眠。他听见马靴硌地的声音睁开眼睛，瞧见黑娃旁边站着一位同样装束的汉子，断定策划二营的目的已经达到，从床上翻身跳下来就与那人握手：“焦振国同志，我肯定可以这样称呼你了。”恰在这时电话铃声响起来，黑娃接上电话正好是孝文打来的，询问黑娃西安城里有没有响动？黑娃迟疑一下瞅瞅鹿兆鹏，鹿兆鹏悄声暗示说：“正好把他诱过来。”黑娃对着话筒神秘他说：“准不准的消息我听到了，你过来一下咱俩当面说。”黑娃放下话筒神色紧张起来：“这一锤子砸得响砸不响，我不敢保险。”焦振国说：“你和他先好说好劝，万一说不成，我就把他拾掇了。”鹿兆鹏点点头说：“就这么办。我和焦营长先避开。”黑娃说：“不。咱三人都坐在当面。那人灵得很，一眼瞅见咱仨摆在这个架势肯定就明白了，说不定话倒好说。”焦振国很冷静也很简练：“毯！只要他进这个门，同意不同意起义都好办。”\n" +
            "\n" +
            "    咯登咯登的马靴声响到开门的那一瞬间，便戛然而止。白孝文推门进来，站在门里就再抬不起脚来，脸色唰地一下变黄了。事情的发展正应了黑娃的估计，在最好和最坏的估计中轻而易举地选择了最好的结局。白孝文先瞅见二营长焦振国就顿生疑虑，黑娃没有在电话里提及二营长，二营长在这里就预示着某种阴谋；及至他瞅瞄到坐在黑娃另一边的陌生军官而且迅即辨认出鹿兆鹏的时候，就定格在门口。鹿兆鹏站起来走向门口：“还记得咱们三个给徐先生到柳林里砍柳木棍子的蠢事吗？咱们砍的棍子头一遭就打到咱们三个的头上。”白孝文笑了笑伸出手说：“我明白你来干什么。”随之握住兆鹏的手，“我心里正在盘算这事哩！真没料到你会回咱县来。你来的好！”白孝文进一步证实说：“我给黑娃打电话，就是想商量这事，咱不能一条黑路走到底嘛！黑娃和焦振国先后站起来，四个人的胳膊互相箍抱着肩膀达成默契。\n" +
            "\n" +
            "    白孝文说：“我把话敞明了说，兆谦你我跟振国是结拜弟兄，你先跟振国叫通了才跟我说，不说你对我心里有没有隔卡，总是把我看扁了。”黑娃一时反不上话来。焦振国掩饰说：“起事的话是我先对兆谦捅破的。”鹿兆鹏说：“话总有个先说后说的问题，要是最后一个跟焦振国说，他也会觉得把他看扁了吧？现在商量起义的事吧！”白孝文说：“这事万无一失。我派兵先把团长县长书记抓起来就完了。”鹿兆鹏说：“让你的部下卡死城门，甭让他们跑了就行。关键是保安团长。孝文和振国去办，先礼后兵，先动员他一块起义，话说不通再动手抓不迟。岳维山是我的老朋友，我想见他了，让黑娃领我去拜望。”黑娃说：“你甭出去，你在这儿等着，免得出个差错划不着。”\n" +
            "\n" +
            "    鹿兆鹏坐在椅子上等着，心里难以抑制的激动却又神智不乱，脑子里开始构思选择见到岳维山时说什么最好。一声枪响又连着一声枪响，接着就再无声息，他难以捉摸枪声里是否隐藏着恶祸？他迅即跳出屋门，问站岗的团丁发生了什么事，团丁惊恐地摇头说搞不清，猜不准。鹿兆鹏突然意识到风才策划的方案过于得简单，甚至不无严重疏漏，完全可能导致出另外的糟糕结局；孝文出门以后如果不是去对付团长，而是对黑娃和焦振国突施袭击呢？刚才的枪声又恰恰响了两下。他转到屋子墙侧的隐蔽处装作尿尿，做好了应变的最坏准备。几个团丁急匆匆杂沓沓走来，似乎还拖拽着一个人，咚地一声扔下了。鹿兆鹏看见白孝文和焦振国走到门口，才放下心走过去，看到门口砖台阶下扔着一具死尸。白孝文说：“我把他拾掇了。”鹿兆鹏间：“你把谁拾掇了？”白孝文说：“团长嘛，还能拾掇谁？”鹿兆鹏问：“他拒不接受起义还是反抗？白孝文不耐烦他说：“他咯咯嚷嚷拿不定主意。谁这阵儿还有心跟他磨缠！”，鹿兆鹏说：“打死了算了，你把尸首拖来弄啥？”孝文轻巧地说：“请你验明正身呀！”\n" +
            "\n" +
            "    三个人重新在屋子里坐下，焦振国说起和张团长谈话的经过。张团长一看见他和白孝文进门就眨眨眼睛，狐疑满面地问：“有啥重要情况，你俩一搭来？”按说他俩此时谁也不该来，应该驻守在阵地上。白孝文说：“西安已经解放了，咱们起义吧！”张团长张了张嘴没说出话，虚汗一下布满脸孔，更加频繁地眨着眼睛，终于咯咯囔囔说：“你们要起义，我不阻挡。看在多年的交情上，让我归还故乡解甲务农。”焦振国还没说旧一句话，白孝文的枪场已经响了，正击中张团长的左胸。张团长猛然弯了腰，双手捂住胸口，好久才扬起头来紧紧盯着白孝文。白孝文对着张团长的脸又射了一枪，张团长迅速像一堵孤墙倒下去。\n" +
            "\n" +
            "    这时，黑娃押着岳维山进来了。\n" +
            "\n" +
            "    鹿兆鹏脑子里还想着张团长被孝文迎面击中的脸孔会是怎样扒皮撕裂的景象，还在想着有无必要迎面放这一枪的事，突然看见了岳维山背缚着双臂站在屋子里的敞亮处。岳维山也显得老了，眼角和额头的皱纹不再细密而变得粗深了，藏青色中山服被麻绳抽拽得再不周正，偏分的头发已经疏朗，也呈现出紊乱，唯有那双眼睛略现懊丧，却绝无一缕畏怯。他很安静地站在屋子中间。沉静的眼神和平静的脸色显示着他的自信。鹿兆鹏依然稳稳坐在椅子上，两只胳膊架在椅子左右两边的扶栏上，十指交叉着一动不动。在岳维山最初进门时，他翻眼瞅了一下，然后就这么坐着不动。对这个人说什么傲视和蔑视的话，已经没有意义，实施怎样的报复也难使人产生报复的痛快，这个人与他效忠的那个政权已经不可挽回地完蛋了，但不说一句什么话，也难以平复情感，他和他毕竟交手争斗了二十多年哪！鹿兆鹏从椅子上站起来，缓缓走到岳维山当面，紧紧盯住那双眼睛，岳维山并不畏怯也不躲避，沉静地盯着兆鹏，两双眼睛就那么对峙着。鹿兆鹏嘬了嘬嘴唇说：“我过去在你手里标价是一千块大洋，你而今在我手里连一个麻钱都不值。”岳维山脸颊上的肌肉抽搐一下，鹿兆鹏一转身重重地甩出一句：“你比我贱！”\n" +
            "\n" +
            "    黑娃请求说：“我把他先关起来吧？”岳维山这时才开了口：“给我一枪，你们也少了麻烦。”鹿兆鹏摆摆手，招呼黑娃说：“咱们先坐下来开会。”随之走到岳维山眼前，解下捆绑着胳膊的细麻绳，拍拍他的肩膀：“你也坐下来旁听。我们要商量滋水县保安团起义的备细事项，你看看你听听，看看我们将怎样摧毁你二十多年来在滋水惨淡经营的那个反动政权吧！”岳维山被鹿兆鹏强按在肩膀上的那只手压坐到一只椅子上，去撑着他身心的那根驻子折断了，歪侧着脑袋闭上眼睛。鹿兆鹏看了看表，扬起头说：“同志们，我们抓紧开会。现在差三分就到零点，滋水县事实上已经属于人民了……”\n" +
            "\n" +
            "    多半年后，即滋水县解放后的一个新年刚刚过罢，副县长鹿兆谦在他的办公室里被逮捕。黑娃那阵子正在起草一份申请恢复自己党籍的申请报告，屋子里走进两个人来，他没抬头，直到来人夺抽手中的毛笔时，他才发觉来人不是向他请示工作。他尚来不及思索，已经被细麻绳索捆死了胳膊。黑娃跳起来喊：“为啥为啥！谁派你们来的？”俩人啥话不说，只推着他往门外走。\n" +
            "\n" +
            "    黑娃被囚进县城西角那座监狱。他向送饭的人和看守的人千遍万遍请求：“我要见县长，我要见白孝文，我要见白县长。”他最后忍不住大声嚎叫：“我要见白孝文白县长！”直到嗓子吼出血，连一丝声音也发不出来。突然躺在床板上，把一些不连贯的往事想过一遍再想一遍。\n" +
            "\n" +
            "    起义的仪式是第二天下午举行的，他的炮营打响了起义的礼炮。鹿兆鹏没有参加那个激动人心的起义，他把一切安排妥当，于黎明时分骑着那辆破自行车就回城里去了，说是师部的工作更加紧迫。听说兆鹏回到西安只待了两天，又随着部队一路朝西打去，一直追打到新疆。他没有给他来信，也没有捎过一句话，现在他在哪里，活着还是死了，都搞不清，据说扶眉战役伤亡很大。如果能搞情兆鹏的下落，一切都会烟消云散。\n" +
            "\n" +
            "    白孝文县长不点头，谁敢逮捕鹿兆谦副县长呢？黑娃就拼命吼嚎白孝文，也许他在县政府里能听见他的叫声。他记得起义后的第三天，原保安回二营长焦振国把一张《群众日报》摔到桌上，“你看看。”黑娃看到西北军政委员会主任贺龙签名的一则电讯，是表彰滋水县保安团起义的。电文的称呼为“滋水县保安团一营营长白孝文同志”。黑娃看罢说：“贺龙弄错，咱们是整个保安团三个营千十个官兵全都参加起义了。不是一营三百多人单独起义的。”焦振国说：“你再看看下面的文章——”黑娃就看到白孝文写给贺龙关于率领一营起义的敬信。黑娃咂了咂舌头说：“孝文这熊弄事光顾自个，你把咱们全团三个营一同起义的事全部报告给贺主任，贺主任肯定更高兴。”焦振国说：“给贺主任写这个报告也轮不到他嘛！你是起义的发起人，又是大家人推的起义的头儿，这是跟鹿兆鹏当面说定的事，他凭啥先给贺主任报头功？”黑娃不满意地瞅了焦振国一眼：“兄弟，不是我说你，你这人心眼儿太窄。这算个啥大不了的事？孝文报了也就报了，他没写上二营三营，难道你我就不算起义？”焦振国撇着嘴角说：“黑娃老哥！你给我开一张起义证明条子，我告老还乡务农呀！”黑娃火了：“你这算做啥？咱们刚起义刚解放恨不能长出三个脑袋八双手，你倒要走了？你走了革命工作撂给谁？我能招架得住？”焦振国毫无所动地坚持要走。黑娃急了说，“你不说清道明，我不开证明！你是不是对我不满？”焦振国说：“我总怯着孝文补打到团长脸上的那一枪。”黑娃仍然没有放手焦振国归乡。半月后，中共滋水县县委第一任书记秦继贤同志赴任，焦振国从他手里磨缠到一张起义证明件，终于回陕南那个闭塞的小县去了。临行时，黑娃只是简单地和他握了握手，很不满意甚至瞧不起这个结拜兄弟的狭隘心胸。\n" +
            "\n" +
            "    黑娃在监狱里蹲了不足一月，任何人都没有前来探望，这是有令禁绝的。他只被提审过两次，罪状有三条：一、土匪匪首残害群众；二、围剿红三十六军；三、杀害共产党员。黑娃对自个在土匪山寨做二拇指的罪行全部供认不讳，只是对人民法官提示一句：“我后来就学为好人了呀？”关于剿灭红三十六军的罪状，黑娃做了充分的辩解，那是大姆指领人干的，只伤害了房顶的一个哨兵，随后又给其他红军战士分发了银元和烟土作为盘缠出山，而且把政委鹿兆鹏接上山去治好了枪伤……年轻的人民法官没有听完黑娃的辩解就笑得不屑再听，讥笑鹿兆谦的为人处事与名字不符，编排功劳跟编故事一样离奇，未免太不谦虚。至于杀害共产党员陈舍娃的事，黑娃已怒不可遏：“那不是共产党员，是游击队的叛徒！他在秦岭游击队里偷偷摸摸侮辱山里女人，事发后害怕受处治逃跑出山，找到我的门下。他并不知道我跟秦岭游击队政委韩裁缝是老交情，后来我问韩政委还要不要这个队员，韩政委说‘人家投奔你了，就由你打发吧’我知道打发的意思。我让部下把他崩咧！”只有这件事法官认真听了他的辩解，而且说：“我们再查查。”\n" +
            "\n" +
            "    黑娃回到号子里就又想起一件事，知道处治叛徒陈舍娃的事范围很小，事过几天之后，在团部开会财只有白孝文问过他。想到这件事，黑娃心里就疑窦顿生，这条罪状难道是白孝文提供的？但又无法对质，更无法肯定，知道这件事的毕竟不是白孝文一个人。\n" +
            "\n" +
            "    第二次审判仍是那三条罪状的又一次复核，这一次黑娃激烈而坚决地拒绝第二条和条三条罪状，只对第一条中所列举的土匪行径部分承认。他毫不含糊地向法官申明：“滋水县保安团的起义是鹿兆鹏策划的，由我发起实施的，从提出起义到起义获得胜利的整个过程，都是由我领导的；西安四周距城最近的七八个县里头，滋水县是唯一一个没有动刀动枪成功举行起义的一个县，我从来也没敢说过我对革命有过功劳，我现在提说这件事是想请你们问一问秦书记和白县长，我的起义能不能拆掉当土匪的罪过？至于第二条第三条列举的罪状，完全是误会。”\n" +
            "\n" +
            "    黑娃的这一席申辩，事实上加速了他的案子的归结。三天后接连的第三次审讯，只是履行了一个宣判审讯结果的简单程序，三条罪状全部取证充分，黑娃的辩解反而成为可笑的抵赖。黑娃在听到判处死刑的宣判时哑然闭口，法官问他还有什么话说，他摇了摇头。黑娃再被押回监狱后换了一间房子，密闭的墙壁上只开了一个可以塞进一只中号黄碗的洞，脚腕上被砸上了生铁铸成的铁镣。两天后，他的妻子高玉凤领着独生儿子前来探望，这是自他被囚二十多天以来见到的唯一一位探监的人。他透过那个递进取出饭碗的洞孔，只能看见妻子大半个脸孔，脸面上一满是泪水和清涕，嘴巴说不出话，只是张了又合，合了又张，像从水里捞出来扔到沙滩上的鲇鱼的嘴。黑娃说：“你要去寻兆鹏，你寻不着，你死了的话，由儿子接着寻。”高玉凤这时才哇地一声哭出来，随之把儿子抱扶起来。他看见洞孔里嵌着儿子的小脸蛋，叫出了一声“爸爸”。黑娃突然转过身，他不忍心看见那张酷似自己的眉眼，便像一棵被齐根锯断的树干一样栽倒下去。\n" +
            "\n" +
            "    白嘉轩得悉黑娃被囚禁的消息，竟然惊慌失措起来。第二天鸡啼起身，背着褡裢下了白鹿原。佝偻着腰小心翼翼踏上滋水河上的木板桥时，有人认出他是解放后第一任滋水县县长的父亲，恭敬地伸出双手搀扶他过桥。白嘉轩挥动手杖，打开了那双搀扶的手，头也不抬踏上了吱扭作响的独木桥。他走进儿子白孝文的办公室时，扬起脑袋，满脸肃杀，语言端出直入：“我愿意担保黑娃！”白孝文愣怔了一下，又释然笑了。从父亲肩头卸下粗线织成“白记”褡裢，扶着父亲在椅子上坐下，倒下上杯茶。这是他荣任县长以来第一次在县城接待父亲，倍觉欢悦。正月十五县城用传统的焰火放花欢度新中国第一个元宵节的时候，他曾邀请父亲和弟弟以及弟媳们到县城去观赏，结果父亲没来，也禁住了弟弟和弟媳。白嘉轩捏着茶杯又重复一遍：“我今日专意担保黑娃来咧。”白孝文却哈哈一笑：“新政府不瞅人情面子，该判就判，不该判的一个也不冤枉，你说的哪朝哪代的老话呀！”白嘉轩很反感儿子的笑声和轻淡的态度：“黑娃不是跟你一搭起义来吗？容不下他当县长，还不能容他回原上种地务庄稼？”白孝文突地变脸：“爸！你再不敢乱说乱问，你不懂人民政府的新政策。你乱说乱问违反政策。”屋子里干部出出进进，忙忙碌碌向白县长汇报请示。白嘉轩还是忍不住说：“这黑娃学好了。人学好了就该容得。”白孝文对父亲说：“你先到我宿舍歇下，我下班以后再陪你啊爸！”\n" +
            "\n" +
            "    镇压黑娃的集会是白鹿原上乡民现存记忆中最浩大的一次。时间选择在农历二月二龙抬头白鹿镇传统的古会日。消息早在三天之前，就从滋水县人民政府发出，通过刚刚成立的白鹿乡人民政府传达到各个村庄，乡民们迫不及待地掐算着古会会日。遵照县政府的指示，乡政府的几个干部夜以继日奔跑在各个村庄，通知各村的男女老少一律不许自由行动，擅自逛会，要由村干部和民兵队长召集排队前往。村民们从来也没有列队行进过，不是挤成圪塔就是断了序列。胳膊上扎着红袖筒的民兵推推搡搡，把那些扭七趔八站着蹲着的男女推到应该站的位置上去。好多村子还没有置备下红旗，于是仍然把往年给三官庙送香火时用的花边龙旗撑出来，只是撕掉了龙的图形贴上了村庄的名字。会场设在白鹿镇南边与小学校之间的空场上，各个村子的队伍按照灰线划定的区域安顿下来。当一队全副武装的解放军战士押着一个死刑犯登上临时搭成的戏台以后，整个会场便潮涌起来，此前为整顿秩序的一切努力都宣告白费。\n" +
            "\n" +
            "    黑娃在被押到台上的时候，才知道和他一起被处决的还有岳维山和田福贤。他被卸下脚镣，推出那间只有一个洞孔的囚室时，就想到了生之即止。随之又被反缚了胳膊，推上一挂马车，由四个解放军押着半夜里上路。马车驶上白鹿原时，天色微曙，凭感觉，他准确地判断出回到原上了，忍不住说：“能让我躺到我的原上算万幸了！”他站在台口，微微低垂着头，胸脯里憋闷难抑，转地身急嘟嘟地对坐在主席台正中的白孝文说：“我不能跟他俩一路挨枪，请你把我单独执行，我只求你这一件事！”没有人搭理他。他被押解的战士使劲扭过来。黑娃就深深地低下头去。\n" +
            "\n" +
            "    白孝文县长发表了讲话。四各各界代表人物做了控诉发言。最后由军事法庭宣布了死刑判决和立即执行的命令。\n" +
            "\n" +
            "    白嘉轩一反常态地参加了这个声势浩大的集会。他对这类热闹从来缺乏热情和好奇，宁可丢剥了衣服热汗蒸腾地踩踏轧花机，也不想挤到人窝里去看要猴的卖大力丸的表演，即使是几十年不遇的杀人场合。镇嵩军枪杀纵火犯时，他没有去；田福贤在小学校西围墙外枪崩鹿兆鹏的那回，他也没有去；这回镇压反革命岳维山田福贤和鹿兆娃的集会他参加了。这个重大活动的地点选择在白鹿原的用意十分明显，被镇压的三个罪犯有两个都是原上的人。只有岳维山是个外乡客；主持这场重大活动的白县长也是原上人。白嘉轩尾随在白鹿村队列最后，因为腰背驼得太厉害，行动迟缓赶不上脚步。他背抄着双手走进会场，依然站在队伍后头，远远瞅见高台正中位置就坐的儿子孝文，忽然想起在那个大雪的早晨，发现慢坡地里白鹿精灵的情景。在解放军战士押着死刑犯走向戏台的混乱中，他浑身涌起巨大的力量，一下子挤到台前，头一眼就瞅见黑娃焦燥干裂的嘴唇和布满血丝的眼睛。黑娃瞅见他的一瞬，垂下头去，一滴一滴清亮的泪珠儿掉下来。白嘉轩没有再看，转身走掉了。他没有瞧和黑娃站成一排的田福贤和岳维山究竟是何种面目，他跟这俩人没有关系。白嘉轩退出人窝，又听到台上传呼起鹿子霖的声音，白鹿原九个保长被传来陪斗接受教育。他背抄起双手离开会场，走进关门闭店的白鹿镇，似乎脚腕上拴着一根绳子，绳子那一头不知是攥在黑娃手里，还是在孝文手上？他摇摇摆摆，走走停停，磨蹭到冷先生的中医堂门口，听到了一串枪响，眼前一黑就栽倒在门坎上。\n" +
            "\n" +
            "    白嘉轩醒来时发觉躺在自家炕上，看见许多亲人的面孔十分诧异，这么多人围在炕头炕下的脚地干什么？他很快发觉这些人的脸色瞧起来很别扭，便用手摸一下自己的脸，才发觉左眼被蒙住了，别扭的感觉是用一只眼睛看人瞅物的结果。白孝文俯下身叫了一声“爸”。白嘉轩睁着右眼问究竟发生了什么事？孝文只是安慰他静心养息，先不要问。白嘉轩侧过头瞅见坐在椅子上的冷先生：“难道你也瞒哄兄弟？”冷先生说：“兄弟，你的病是‘气血蒙目’，你甭怨我手狠。”白嘉轩还不能完全明白：“你把话说透。”冷先生这才告诉他，倒在中医堂门坎上那阵儿，手指捏得扮不开，双腿像两条硬棍于弯不回来，左眼眼球像铃铛儿一样鼓出眼眶，完全是一包滴溜溜儿的血。这病他一生里只见一例，那是南原桑枝村一个老寡妇得的。她守寡半世，把两个儿子拉扯成人，兄弟便分家时，为财产打得头破血流，断胳膊坏腿，老寡妇气得栽倒在地气血蒙眼。冷先生被请去时已为时太晚，眼球上薄如蝉翼的血泡儿业已破裂，血水从窟窿里汩汩流出来，直到老寡妇气绝。冷先生说：“我来不及跟谁商量就动了刀子。这病单怕血泡儿破了就收拾不住了。”白嘉轩摸了摸左眼上蒙着的布条儿，冷漠地笑笑：“你当初就该让它破了去！”众人纷纷劝慰白嘉轩。白孝文压低声儿提醒冷先生说：“大伯，这件事日后再甭说了，传出去怕影响不大好。”\n" +
            "\n" +
            "    一月后，白嘉轩重新出现在白鹿村村巷里，鼻梁上架起了一副眼镜。这是祖传的一副水晶石头眼镜，两条黄铜硬腿儿，用一根黑色丝带儿套在头顶，以防止掉下来碎了。白嘉轩不是鼓不起往昔里强盛凛然的气势，而是觉得完全没有必要，尤其是作为白县长的父亲，应该表现出一种善居乡里的伟大谦虚来，这是他躺在炕上养息眼伤的一月里反反覆覆反思的最终结果。微显茶色的镜片保护着右边的好眼，也遮掩着左边被冷先生的刀子挖掉了眼球的瞎眼，左眼已经凹陷成一个丑陋的坑洼。他的气色滋润柔和，脸上的皮肤和所有器官不再绷紧，全部现出世事洞达者的平和与超脱，骤然增多的白发和那副眼镜更添加了哲人的气度。他自己一手拄着拐杖，一手拉着黄牛到原坡上去放青，站在坡坎上久久凝视远处暮蔼中南山的峰峦。\n" +
            "\n" +
            "    白嘉轩牵着牛悠悠回家，在村外路外撞见鹿子霖就驻足伫立。在一道高及膝头的台田塄坎上，鹿子霖趴在已经返青的麦田里，用一只废弃的镰刀片子，在塄坎的草丝中专心致意地掏挖着牛奶奶的块状根茎。他的棉衣棉裤里处线断缝开，吊着一缕缕一串串污脏的棉花套儿，满头的灰色头发像丢弃的破毡片子苫住了耳朵和脖颈，黄里透亮的脸上涂抹着眼屎鼻涕和灰垢，两只手完全变成乌鸦爪子了。他匍匍在地上扭动着腰腿，使着劲儿从草丛刨挖出一颗鲜嫩嫩的羊奶奶，捡起来擦也不擦，连同泥土一起塞进嘴里，整个脸颊上的皮肉都随着嘴巴香甜的咀嚼而欢快地运动起来，嘴角淤结着泥土和羊奶奶白色的液汁。鹿子霖抬头盯了白嘉轩一眼，又急忙低下去，用左胳膊圈盖了一片羊奶奶的茎蔓，而且吐哝着：“你想吃你自个找去，这是我寻见的，我全占下咧！”白嘉轩往前凑了凑问：“子霖。你真个不认不得我咧？”鹿子霖头也不抬，只忙于挖刨：“认得认得，我在原上就没有生人喀！你快放你的牛，我忙着哩！”白嘉轩判断出这人确实已以丧失了全部生活记忆时，就不再开口。\n" +
            "\n" +
            "    鹿子霖被民兵押到台下去陪斗，瞧见发即将被处死的岳维山、田福贤和鹿黑娃，觉得那枪膛的快枪子弹将擦着自己的耳梢射进那三人的脑袋。耳梢和脑袋可就只差着半寸。他瞅见主持这场镇压反革命集会的白孝文，就在心里喊着：“天爷爷，鹿家还是弄不过白家！”当他与另外九个保长一排溜面对拥挤的乡民低头端立在台子前头时，就听着一个又一个人跳上台子控诉岳、田和黑娃的罪恶，台下一阵高过一阵要求处死这三个人的口号声浪。鹿子霖感到不堪负载，双腿打软几次差点跌跪下去。突然脑子里嘣嘣一响，似乎肩上负压的重物被推卸去，浑身轻若纸灰。拥挤在鹿子霖近前的人嗅到一股臭气，有人惊奇地嘻笑着叫起来：“鹿子霖吓得屙到裤裆了！”许多人捂鼻掩口，却争着瞧鹿子霖。屎屎顺着棉裤裤筒流下来，灌进鞋袜，流溢到脚下的地上，恶臭迅速扩散到会场。民兵发现后，请示过白孝文，得到允许就把鹿子霖推着搡着弄出会场去了。\n" +
            "\n" +
            "    冷先生的中药和针灸对鹿子霖全部无能为力，他被家人捆在树上灌进一碗又一碗汤药，仍然在裤裆里尿尿屙屎。他的有灵性的生命已经宣告结束，没有一丝灵性的生命继续延缓下来。女人鹿贺氏也不再给他换衣换裤裤，只在吃饭时塞给他一碗饭或一个馍，就把他推出后门，他身上的新屎陈尿足以使一切人窒息。夜晚他和那条黄狗蜷卧在一起，常常从狗食盆里抓起剩饭塞进嘴里。\n" +
            "\n" +
            "    白嘉轩看着鹿子霖挖出一大片湿土，被割断的羊奶奶蔓子扔了一堆，忽然想起以卖地形式作掩饰巧取鹿子霖慢坡地做坟园的事来，儿子孝文是县长，也许正是这块风水宝地荫育的结果。他俯下身去，双手拄着拐杖，盯着鹿子霖的眼睛说：“子霖，我对不住你。我一辈子就做下这一件见不人的事，我来生再世给你还债补心。”鹿子霖却把一颗鲜灵灵的羊奶奶递到他眼前：“给你吃，你吃吧，咱俩好！”白嘉轩轻轻摇摇头，转过身时忍不住流下泪来。\n" +
            "\n" +
            "    农历四月以后，气温骤升，鹿子霖常常脱得一丝不挂满村乱跑。鹿贺氏把他锁在柴禾房里，整整锁了半年之久。他每到晚上，便嚎着叫着哭着唱着，村里人已经习以为常。入冬后第一次寒潮侵袭白鹿原的那天夜时，前半夜还听见鹿子霖的嚎叫声，后半夜却屏声静气了。天明时，他的女人鹿贺氏才发现他已经僵硬，刚穿上身的棉裤里屎尿结成黄蜡蜡的冰块……";
}
